Documents/ПротоколОпросаУчастникаНесчастногоСлучая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПротоколОпросаУчастникаНесчастногоСлучая</Name>
			<BasedOn>
				<xr:Item>Document.НесчастныйСлучайНаПроизводстве</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НесчастныйСлучайНаПроизводстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпросПроизвел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпросНачат</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпросОкончен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОпрашиваемогоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпрашиваемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехническиеСредстваОпроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияОпрашиваемогоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроисшествия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСоставленияПротоколаОпроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставленияПротоколаОпроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставПострадавшие</Name>
					<Comment>АПК:58 Краткий перечень пострадавших сотрудников</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставУчастники</Name>
					<Comment>АПК:58 Краткий перечень участников осмотра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиОпроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцессуальноеПоложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоступившиеЗаявления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пострадавшие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пострадавший</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПротоколОпросаУчастникаНесчастногоСлучая/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"НесчастныеСлучаи");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьКраткийСостав = Ложь;
	ОписаниеСостава.ИспользоватьОграничениеДоступа = Ложь;
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	
	ЗарплатаКадрыСоставДокументов.ДобавитьОписаниеХраненияСотрудниковФизическихЛиц(
		ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц,
		"Пострадавшие",
		"Пострадавший");
		
	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	// Протокол опроса
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПротоколОпросаУчастникаНесчастногоСлучая";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколОпроса2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Протокол опроса'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПротоколОпросаУчастникаНесчастногоСлучая";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколОпроса2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Протокол опроса'");
	КомандаПечати.Порядок = 15;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПротоколОпросаУчастникаНесчастногоСлучая";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколОпросаОчевидцев";
	КомандаПечати.Представление = НСтр("ru = 'Протокол опроса очевидцев'");
	КомандаПечати.Порядок = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	// ЗУПК
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпроса2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпроса2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпроса2003Кв1",
			НСтр("ru = 'Протокол опроса'"), ПечатьПротоколаОпроса(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпроса2003Кв1");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпроса2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпроса2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпроса2022Кв3",
			НСтр("ru = 'Протокол опроса'"), ПечатьПротоколаОпроса(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпроса2022Кв3");
	// ЗУПК
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпросаОчевидцев") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпросаОчевидцев");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОпросаОчевидцев",
			НСтр("ru = 'Акт расследования несчастного случая'"), ПечатьПротоколОпросаОчевидцев(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.ПротоколОпросаУчастникаНесчастногоСлучая.ПФ_MXL_ПротоколОпросаОчевидцев");
	// ЗУПК
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПротоколаОпроса(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПротоколОпросаУчастникаНесчастногоСлучая_ПротоколОпроса";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Раздел1_1 = Макет.ПолучитьОбласть("Раздел1_1");
		Раздел1_2 = Макет.ПолучитьОбласть("Раздел1_2");
		Раздел1_3 = Макет.ПолучитьОбласть("Раздел1_3");
		РазделТипПострадавший = Макет.ПолучитьОбласть("ТипПострадавший");
		РазделТипОчевидец = Макет.ПолучитьОбласть("ТипОчевидец");
		РазделТипДолжностноеЛицо = Макет.ПолучитьОбласть("ТипДолжностноеЛицо");
		Раздел2 = Макет.ПолучитьОбласть("Раздел2");
		Раздел3 = Макет.ПолучитьОбласть("Раздел3");
		Раздел4 = Макет.ПолучитьОбласть("Раздел4");
		Раздел5 = Макет.ПолучитьОбласть("Раздел5");
		Раздел6 = Макет.ПолучитьОбласть("Раздел6");
		Раздел7 = Макет.ПолучитьОбласть("Раздел7");
		ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
		ДопПодпись = Макет.ПолучитьОбласть("ДопПодпись");
		
		////////////////////////////////////////////////
		// Область 1_1
		
		Раздел1_1.Параметры.Заполнить(ДанныеДокумента);
		
		ТабличныйДокумент.Вывести(Раздел1_1);
		
		/////////////////////////////////////////////////
		// Область ВидОпрашиваемогоЛица
		
		Если ДанныеДокумента.ВидОпрашиваемогоЛица = НСтр("ru = 'Пострадавший'") Тогда
			ТабличныйДокумент.Вывести(РазделТипПострадавший);
		ИначеЕсли ДанныеДокумента.ВидОпрашиваемогоЛица = НСтр("ru = 'Очевидец'") Тогда
			ТабличныйДокумент.Вывести(РазделТипОчевидец);
		ИначеЕсли ДанныеДокумента.ВидОпрашиваемогоЛица = НСтр("ru = 'Должностное лицо'") Тогда
			ТабличныйДокумент.Вывести(РазделТипДолжностноеЛицо);
		КонецЕсли;
		
		////////////////////////////////////////////////
		// Раздел 1_2
		
		Раздел1_2.Параметры.Заполнить(ДанныеДокумента);
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ДополнительныеСведения, "60,110");
		Раздел1_2.Параметры.ДополнительныеСведенияЧасть1 = СписокСтрок[0];
		Раздел1_2.Параметры.ДополнительныеСведенияЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Раздел1_2);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		////////////////////////////////////////////////
		// Раздел 1_3
		
		Раздел1_3.Параметры.ОпрашиваемоеЛицоИнициалы = ДанныеДокумента.ОпрашиваемоеЛицоИнициалы;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаУчастникиОпроса, "55,110,110, 110");
		Раздел1_3.Параметры.ИныеЛицаОпросаЧасть1 = СписокСтрок[0];
		Раздел1_3.Параметры.ИныеЛицаОпросаЧасть2 = СписокСтрок[1];
		Раздел1_3.Параметры.ИныеЛицаОпросаЧасть3 = СписокСтрок[2];
		Раздел1_3.Параметры.ИныеЛицаОпросаЧасть4 = СписокСтрок[3];
		
		ТабличныйДокумент.Вывести(Раздел1_3);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 4);
		
		////////////////////////////////////////////////
		// Раздел 2
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ТехническиеСредстваОпроса, "20, 110");
		Раздел2.Параметры.ТехническиеСредстваОпросаЧасть1 = СписокСтрок[0];
		Раздел2.Параметры.ТехническиеСредстваОпросаЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Раздел2);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		////////////////////////////////////////////////
		// Раздел 3
		
		Раздел3.Параметры.ДатаПроисшествия = ДанныеДокумента.ДатаПроисшествия;
		Раздел3.Параметры.ПострадавшийФИОПрофессияДолжность = ДанныеДокумента.СтрокаПострадавшие;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ПоказанияОпрашиваемогоЛица, "110, 110, 110, 110, 110, 110");
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть1 = СписокСтрок[0];
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть2 = СписокСтрок[1];
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть3 = СписокСтрок[2];
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть4 = СписокСтрок[3];
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть5 = СписокСтрок[4];
		Раздел3.Параметры.ПоказанияОпрашиваемогоЛицаЧасть6 = СписокСтрок[5];
		
		ТабличныйДокумент.Вывести(Раздел3);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 6);
		
		////////////////////////////////////////////////
		// Раздел 4
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаУчастникиОпроса, "25, 110");
		Раздел4.Параметры.УчастникиОпросаПоложениеФиоЧасть1 = СписокСтрок[0];
		Раздел4.Параметры.УчастникиОпросаПоложениеФиоЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Раздел4);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		////////////////////////////////////////////////
		// Раздел 5
		
		Раздел5.Параметры.ПрисутствиеЗаявлений = ДанныеДокумента.ПрисутствиеЗаявлений;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПоступившиеЗаявления, "30, 110, 110, 110");
		Раздел5.Параметры.ПоступившиеЗаявленияЧасть1 = СписокСтрок[0];
		Раздел5.Параметры.ПоступившиеЗаявленияЧасть2 = СписокСтрок[1];
		Раздел5.Параметры.ПоступившиеЗаявленияЧасть3 = СписокСтрок[2];
		Раздел5.Параметры.ПоступившиеЗаявленияЧасть4 = СписокСтрок[3];
		
		ТабличныйДокумент.Вывести(Раздел5);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 4);
		
		/////////////////////////////////////////////////
		// Раздел 6
		
		Раздел6.Параметры.ОпросПроизвелФИО = ДанныеДокумента.ОпросПроизвелФИО;
		
		ПервыйУчастникОпроса = Истина;
		Для каждого ФИОУчастникаОпроса Из ДанныеДокумента.МассивУчастниковОпроса Цикл
			Если ПервыйУчастникОпроса Тогда
				ПервыйУчастникОпроса = Ложь;
				Раздел6.Параметры.УчастникиОпросаФИО = ФИОУчастникаОпроса;
				ТабличныйДокумент.Вывести(Раздел6);
			Иначе
				ДопПодпись.Параметры.УчастникиОпросаФИО = ФИОУчастникаОпроса;
				ТабличныйДокумент.Вывести(ДопПодпись);
			КонецЕсли;
		КонецЦикла;
		
		/////////////////////////////////////////////////
		// Раздел 7
		
		Раздел7.Параметры.ОпрашиваемоеЛицоИнициалы = ДанныеДокумента.ОпрашиваемоеЛицоИнициалы;
		Раздел7.Параметры.ОпросПроизвелФИО = ДанныеДокумента.ОпросПроизвелФИО;
		
		ТабличныйДокумент.Вывести(Раздел7);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// ЗУПК
Функция ПечатьПротоколОпросаОчевидцев(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПротоколОпросаУчастникаНесчастногоСлучая_АктОНесчастномСлучае";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область1 = Макет.ПолучитьОбласть("Область1");
		ВопросОтвет = Макет.ПолучитьОбласть("ВопросОтвет");
		Область2 = Макет.ПолучитьОбласть("Область2");
		СтрокаУчастникОпроса = Макет.ПолучитьОбласть("СтрокаУчастникОпроса");
		
		////////////////////////////////////////////////
		// Область 1
		
		Область1.Параметры.Заполнить(ДанныеДокумента);
		
		Область1.Параметры.ПроисшествиеДата = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДФ='''""''дд''""'' ММММ гггг ''года'''; ДП='""___"" ______________ 20____ года'");
		
		Область1.Параметры.ПроисшествиеЧасы = Час(ДанныеДокумента.ДатаПроисшествияДатаВремя);
		Область1.Параметры.ПроисшествиеМинуты = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДФ=мм");
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПострадавшиеСоСклонениями, "95, 999");
		Область1.Параметры.СведенияОПострадавшихЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОПострадавшихЧасть2 = СписокСтрок[1];
		
		НаименованиеОрганизацииОписаниеРабочегоМеста = ДанныеДокумента.НаименованиеОрганизации + ", место происшествия: " + ДанныеДокумента.ХарактеристикаМестаПроисшествия;
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(НаименованиеОрганизацииОписаниеРабочегоМеста, "95, 999");
		Область1.Параметры.НаименованиеОрганизацииОписаниеРабочегоМестаЧасть1 = СписокСтрок[0];
		Область1.Параметры.НаименованиеОрганизацииОписаниеРабочегоМестаЧасть2 = СписокСтрок[1];
		
		ГодРождения = Прав(ДанныеДокумента.ОпрашиваемоеЛицоДатаРождения, 7);
		Область1.Параметры.ОпрашиваемоеЛицоГодРождения = ГодРождения;
		
		ОсновнойСотрудник = КадровыйУчетРасширенный.ОсновнойСотрудникФизЛица(ДанныеДокумента.ОпрашиваемоеЛицо, ДанныеДокумента.Организация, ДанныеДокумента.ДатаПроисшествияДатаВремя, Ложь);
		ЗапрашиваемыеКадровыеДанные = "Должность, СтажРаботыНаПредприятииЛет, СтажРаботыНаПредприятииМесяцев, СтажРаботыНаПредприятииДней";
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОсновнойСотрудник, ЗапрашиваемыеКадровыеДанные, ДанныеДокумента.ДатаПроисшествияДатаВремя);
		Для Каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДолжностьМестоРаботы = Строка(СтрокаКадровыхДанных.Должность) + ", " + ДанныеДокумента.ОпрашиваемоеЛицоМестоРаботы;
			Область1.Параметры.ОпрашиваемоеЛицоДолжностьМестоРаботы = ДолжностьМестоРаботы;
			
			Стаж = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(СтрокаКадровыхДанных.СтажРаботыНаПредприятииЛет, СтрокаКадровыхДанных.СтажРаботыНаПредприятииМесяцев, СтрокаКадровыхДанных.СтажРаботыНаПредприятииДней);
			Область1.Параметры.ОпрашиваемоеЛицоСтаж = Стаж;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеДокумента.ОпрашиваемоеЛицоМестоЖительства) И ЗначениеЗаполнено(ДанныеДокумента.ОпрашиваемоеЛицоТелефон) Тогда
			АдресТелефон = ДанныеДокумента.ОпрашиваемоеЛицоМестоЖительства + "; " + ДанныеДокумента.ОпрашиваемоеЛицоТелефон;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(АдресТелефон, "90,999");
		ИначеЕсли ЗначениеЗаполнено(ДанныеДокумента.ОпрашиваемоеЛицоМестоЖительства) Тогда
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОпрашиваемоеЛицоМестоЖительства, "90,999");
		ИначеЕсли ЗначениеЗаполнено(ДанныеДокумента.ОпрашиваемоеЛицоТелефон) Тогда
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОпрашиваемоеЛицоТелефон, "90,999");
		Иначе
			СписокСтрок = Новый Массив(2);
		КонецЕсли;
		Область1.Параметры.ОпрашиваемоеЛицоАдресТелефонЧасть1 = СписокСтрок[0];
		Область1.Параметры.ОпрашиваемоеЛицоАдресТелефонЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область1);
		
		ТабличныйДокумент.Вывести(ВопросОтвет);
		
		Область2.Параметры.ДатаСоставленияПротокола = Формат(ДанныеДокумента.ДатаСоставленияПротоколаОпроса, "ДФ='''""''дд''""'' ММММ гггг ''года'''; ДП='""___"" ______________ 20____ года'");
		
		ЭтоПервый = Истина;
		Для Каждого УчастникОпроса Из ДанныеДокумента.МассивУчастниковОпросаРК Цикл
			Если ЭтоПервый Тогда
				Область2.Параметры.УчастникОпроса = УчастникОпроса;
				ЭтоПервый = Ложь;
				ТабличныйДокумент.Вывести(Область2);
			Иначе
				СтрокаУчастникОпроса.Параметры.УчастникОпроса = УчастникОпроса;
				ТабличныйДокумент.Вывести(СтрокаУчастникОпроса);
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоПервый Тогда // участники опроса не заполнены
			ТабличныйДокумент.Вывести(Область2);
			ТабличныйДокумент.Вывести(СтрокаУчастникОпроса);
			ТабличныйДокумент.Вывести(СтрокаУчастникОпроса);
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
// ЗУПК

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Ссылка,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Номер,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Дата,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Проведен,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Организация,
	|	Организации.НаименованиеПолное КАК НаименованиеОрганизации,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Подразделение,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ДокументОснование,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ОпросПроизвел,
	|	Сотрудники.ФизическоеЛицо КАК ОпросПроизвелФизическоеЛицо,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ОпросНачат,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ОпросОкончен,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.МестоПроведения,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ВидОпрашиваемогоЛица,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ОпрашиваемоеЛицо,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ДополнительныеСведения,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ТехническиеСредстваОпроса,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ПоказанияОпрашиваемогоЛица,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.МестоСоставленияПротоколаОпроса,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ДатаСоставленияПротоколаОпроса,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Руководитель,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ДолжностьРуководителя,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ОтветственныйЗаОхрануТруда,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.ДолжностьОтветственногоЗаОхрануТруда,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Ответственный,
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Комментарий,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводстве.ХарактеристикаМестаПроисшествия,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводстве.ДатаПроисшествия КАК ДатаПроисшествияДатаВремя
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ПротоколОпросаУчастникаНесчастногоСлучая КАК ПротоколОпросаУчастникаНесчастногоСлучая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
	|		ПО ПротоколОпросаУчастникаНесчастногоСлучая.ДокументОснование = НесчастныйСлучайНаПроизводстве.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПротоколОпросаУчастникаНесчастногоСлучая.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ПротоколОпросаУчастникаНесчастногоСлучая.ОпросПроизвел = Сотрудники.Ссылка
	|ГДЕ
	|	ПротоколОпросаУчастникаНесчастногоСлучая.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса.Ссылка,
	|	ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса.Участник,
	|	ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса.ПроцессуальноеПоложение,
	|	ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса.ПоступившиеЗаявления,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТУчастникиОпросаФизическиеЛица
	|ИЗ
	|	Документ.ПротоколОпросаУчастникаНесчастногоСлучая.УчастникиОпроса КАК ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО ПротоколОпросаУчастникаНесчастногоСлучаяУчастникиОпроса.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.Организация КАК Организация,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто,
	|	Должности.Наименование КАК НаименованиеДолжности,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажОбщийПредставление,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажВОрганизацииПредставление,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ОпьянениеПострадавшего,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ВидИСтепеньОпьянения,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ХарактерПовреждений,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияСОУТ,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияОПСОУТ,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТПострадавшиеФизическиеЛица
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ДанныеДокументов.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто = РабочиеМеста.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (РабочиеМеста.Должность = Должности.Ссылка)";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТУчастникиОпросаФизическиеЛица", "Участник,Период");
	// ЗУПК
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО,ФИОПолные");
	// ЗУПК
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчастникиОпроса.Ссылка,
	|	УчастникиОпроса.Участник,
	|	УчастникиОпроса.ПроцессуальноеПоложение,
	|	УчастникиОпроса.ПоступившиеЗаявления,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.ФИОПолные,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.ФамилияИО
	|ПОМЕСТИТЬ ВТУчастникиОпроса
	|ИЗ
	|	ВТУчастникиОпросаФизическиеЛица КАК УчастникиОпроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО УчастникиОпроса.Участник = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУчастникиОпросаФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТПострадавшиеФизическиеЛица", "Пострадавший,Период");
	// ЗУПК
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО, Профессии, ФИОПолные, Пол");
	// ЗУПК
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Организация КАК Организация,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	Пострадавшие.НаименованиеДолжности,
	|	Пострадавшие.СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление,
	|	Пострадавшие.ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ,
	|	КадровыеДанныеФизическихЛиц.ФамилияИО,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.ФИОПолные,
	|	КадровыеДанныеФизическихЛиц.Пол,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.Профессии
	|ПОМЕСТИТЬ ВТПострадавшие
	|ИЗ
	|	ВТПострадавшиеФизическиеЛица КАК Пострадавшие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Пострадавшие.Пострадавший = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПострадавшиеФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		ДанныеПечати.Вставить("ДатаПроисшествия", Формат(Выборка.ДатаПроисшествияДатаВремя, "ДЛФ=ДД"));
		// ЗУПК
		ДанныеПечати.Вставить("ХарактеристикаМестаПроисшествия", Выборка.ХарактеристикаМестаПроисшествия);
		// ЗУПК
		
		ДанныеПечати.Вставить("ОпросНачатЧасы", Час(ДанныеПечати.ОпросНачат));
		ДанныеПечати.Вставить("ОпросНачатМинуты", Формат(ДанныеПечати.ОпросНачат, "ДФ=мм"));
		ДанныеПечати.Вставить("ОпросОконченЧасы", Час(ДанныеПечати.ОпросОкончен));
		ДанныеПечати.Вставить("ОпросОконченМинуты", Формат(ДанныеПечати.ОпросОкончен, "ДФ=мм"));
		
		ДанныеПечати.Вставить("ОпросПроизвелДолжностьФИО", "");
		ДанныеПечати.Вставить("ОпросПроизвелФИО", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоФИО", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоДатаРождения", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоРождения", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоЖительства", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоТелефон", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоГражданство", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоОбразование", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоСемейноеПоложение", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоРаботы", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоПрофессия", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоИнициалы", "");
		ДанныеПечати.Вставить("СтрокаУчастникиОпросаФИО", "");
		ДанныеПечати.Вставить("СтрокаУчастникиОпроса", "");
		ДанныеПечати.Вставить("СтрокаПоступившиеЗаявления", "");
		ДанныеПечати.Вставить("ПрисутствиеЗаявлений", НСтр("ru = 'Не поступили'"));
		ДанныеПечати.Вставить("МассивУчастниковОпроса", Новый Массив);
		ДанныеПечати.Вставить("СтрокаПострадавшие", "");
		// ЗУПК
		ДанныеПечати.Вставить("СтрокаПострадавшиеСоСклонениями", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоФамилия", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоИмя", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоОтчество", "");
		ДанныеПечати.Вставить("ОпрашиваемоеЛицоВидОбразования", "");
		ДанныеПечати.Вставить("МассивУчастниковОпросаРК", Новый Массив);
		// ЗУПК
		
		// ОпросПроизвел
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДанныеПечати.ОпросПроизвел, "ФамилияИО, Должность", ДанныеПечати.ДатаПроисшествияДатаВремя);
		Для Каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ОпросПроизвелДолжностьФИО", Строка(СтрокаКадровыхДанных.Должность) + " " + СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ОпросПроизвелФИО", СтрокаКадровыхДанных.ФамилияИО);
		КонецЦикла;
		
		// ОпрашиваемоеЛицо
		СтрокаКадровыхДанных = "ФамилияИО, ДатаРождения, МестоРождения, АдресМестаПроживанияПредставление, ТелефонМобильныйПредставление, Страна, ПолученныеОбразования, СостояниеВБраке, Профессии
		// ЗУПК
		|, Фамилия, Имя, Отчество, Образование1ВидОбразования";
		// ЗУПК
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.ОпрашиваемоеЛицо, СтрокаКадровыхДанных, ДанныеПечати.ДатаПроисшествияДатаВремя);
		
		Для Каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоФИО", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКадровыхДанных.ФизическоеЛицо, "Наименование"));
			// ЗУПК
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоФамилия", СтрокаКадровыхДанных.Фамилия);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоИмя", СтрокаКадровыхДанных.Имя);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоОтчество", СтрокаКадровыхДанных.Отчество);
			ВидОбразования = СтрЗаменить(Строка(СтрокаКадровыхДанных.Образование1ВидОбразования), "Высшее образование - ", "");
			ВидОбразования = СтрЗаменить(ВидОбразования, " образование", "");
			ВидОбразования = ВРег(Лев(ВидОбразования, 1)) + Сред(ВидОбразования, 2);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоВидОбразования", ВидОбразования);
			// ЗУПК
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоДатаРождения", Формат(СтрокаКадровыхДанных.ДатаРождения, "ДЛФ=ДД"));
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоРождения", ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(СтрокаКадровыхДанных.МестоРождения));
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоЖительства", СтрокаКадровыхДанных.АдресМестаПроживанияПредставление);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоТелефон", СтрокаКадровыхДанных.ТелефонМобильныйПредставление);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоГражданство", СтрокаКадровыхДанных.Страна);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоОбразование", СтрокаКадровыхДанных.ПолученныеОбразования);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоСемейноеПоложение", СтрокаКадровыхДанных.СостояниеВБраке);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоМестоРаботы", ДанныеПечати.НаименованиеСокращенное);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоПрофессия", СтрокаКадровыхДанных.Профессии);
			ДанныеПечати.Вставить("ОпрашиваемоеЛицоИнициалы", СтрокаКадровыхДанных.ФамилияИО);
		КонецЦикла;
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(Выборка.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчастникиОпроса.Ссылка,
	|	УчастникиОпроса.Участник,
	|	УчастникиОпроса.ПроцессуальноеПоложение,
	|	УчастникиОпроса.ПоступившиеЗаявления,
	|	ВЫБОР
	|		КОГДА УчастникиОпроса.Участник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА УчастникиОпроса.ФИОПолные
	|		ИНАЧЕ УчастникиОпроса.Участник
	|	КОНЕЦ КАК ФИОПолные,
	|	ВЫБОР
	|		КОГДА УчастникиОпроса.Участник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА УчастникиОпроса.ФамилияИО
	|		ИНАЧЕ УчастникиОпроса.Участник
	|	КОНЕЦ КАК ФамилияИО
	|ИЗ
	|	ВТУчастникиОпроса КАК УчастникиОпроса
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчастникиОпроса.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаУчастникиОпросаФИО = "";
		СтрокаУчастникиОпроса = "";
		СтрокаПоступившиеЗаявления = "";
		МассивУчастниковОпроса = Новый Массив;
		// ЗУПК
		МассивУчастниковОпросаРК = Новый Массив;
		// ЗУПК
		
		Пока Выборка.Следующий() Цикл
			СтрокаУчастникиОпросаФИО = СтрокаУчастникиОпросаФИО + Выборка.ФамилияИО + ", ";
			СтрокаУчастникиОпроса = СтрокаУчастникиОпроса + Выборка.ПроцессуальноеПоложение + " " + Выборка.ФамилияИО + ", ";
			Если Не ПустаяСтрока(Выборка.ПоступившиеЗаявления) Тогда
				СтрокаПоступившиеЗаявления = СтрокаПоступившиеЗаявления + Выборка.ФамилияИО + ": " + Выборка.ПоступившиеЗаявления + ", ";
			КонецЕсли;
			Если Выборка.Участник <> ДанныеПечати.ОпросПроизвелФизическоеЛицо Тогда
				МассивУчастниковОпроса.Добавить(?(ТипЗнч(Выборка.Участник) = Тип("Строка"), Выборка.Участник, Выборка.ФамилияИО));
				// ЗУПК
				МассивУчастниковОпросаРК.Добавить(?(ТипЗнч(Выборка.Участник) = Тип("Строка"), Выборка.Участник, Выборка.ФИОПолные));
				// ЗУПК
			КонецЕсли;
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаУчастникиОпросаФИО, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаУчастникиОпроса, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПоступившиеЗаявления, 2);
		ДанныеПечати.Вставить("СтрокаУчастникиОпросаФИО", СтрокаУчастникиОпросаФИО);
		ДанныеПечати.Вставить("СтрокаУчастникиОпроса", СтрокаУчастникиОпроса);
		ДанныеПечати.Вставить("СтрокаПоступившиеЗаявления", СтрокаПоступившиеЗаявления);
		ДанныеПечати.Вставить("ПрисутствиеЗаявлений", ?(ПустаяСтрока(СтрокаПоступившиеЗаявления), НСтр("ru = 'Не поступили'"), НСтр("ru = 'Поступили'")));
		ДанныеПечати.Вставить("МассивУчастниковОпроса", МассивУчастниковОпроса);
		// ЗУПК
		ДанныеПечати.Вставить("МассивУчастниковОпросаРК", МассивУчастниковОпросаРК);
		// ЗУПК
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Организация КАК Организация,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	Пострадавшие.НаименованиеДолжности,
	|	Пострадавшие.СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление,
	|	Пострадавшие.ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ,
	|	Пострадавшие.ФамилияИО,
	// ЗУПК
	|	Пострадавшие.ФИОПолные,
	|	Пострадавшие.Пол,
	// ЗУПК
	|	Пострадавшие.Профессии
	|ИЗ
	|	ВТПострадавшие КАК Пострадавшие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пострадавшие.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПострадавшие = "";
		// ЗУПК
		СтрокаПострадавшиеСоСклонениями = "";
		// ЗУПК
		Пока Выборка.Следующий() Цикл
			СтрокаПострадавшие = СтрокаПострадавшие + Выборка.ФамилияИО + " " + СокрЛП(Выборка.Профессии) + " " + СокрЛП(Выборка.НаименованиеДолжности) + ", ";
			// ЗУПК
			ФИОПострадавшегоСклоняемое = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(Выборка.ФИОПолные), 5, ФИОПострадавшегоСклоняемое, Выборка.Пол);
			
			ДолжностьСклоняемая = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(Выборка.НаименованиеДолжности), 5, ДолжностьСклоняемая);
			
			СтрокаПострадавшиеСоСклонениями = СтрокаПострадавшиеСоСклонениями + ФИОПострадавшегоСклоняемое + ", " + ДолжностьСклоняемая + "; ";
			// ЗУПК
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПострадавшие, 2);
		ДанныеПечати.Вставить("СтрокаПострадавшие", СтрокаПострадавшие);
		// ЗУПК
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПострадавшиеСоСклонениями, 2);
		ДанныеПечати.Вставить("СтрокаПострадавшиеСоСклонениями", СтрокаПострадавшиеСоСклонениями);
		// ЗУПК
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
